export const FascinateNotes = {
    components: `
        <section class='fascinate-notes-1'>
            <div class='fascinate-notes-section'>
                <div class='fascinate-notes-flex-column-image'>
                    <div class='fascinate-note-section-image-showcase'>
                        <img src='../assets/fascinate-notes/fascinate-note-section-1.png'>
                    </div>
                    <div class='fascinate-notes-section-mark'>
                        <svg width="166" height="50" viewBox="0 0 166 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <rect width="166" height="50" fill="#FFF000"/>
                            <path d="M7.896 41H2.814V21.722C2.814 18.404 4.578 16.808 8.022 16.808H11.424V21.764H9.366C8.4 21.764 7.896 22.268 7.896 23.234V34.112H8.148L12.264 28.106H14.742L18.858 34.112H19.11V16.808H24.192V41H19.11L13.608 33.104H13.398L7.896 41ZM35.1783 41.588C30.6003 41.588 27.8703 38.9 27.8703 34.742C27.8703 29.618 31.9863 26.426 38.6223 26.426H42.3603V25.166C42.3603 22.52 40.6803 21.008 37.9923 21.008C35.9343 21.008 34.0863 21.89 32.7003 23.57L29.0883 20.294C31.3983 17.774 34.6743 16.22 38.4963 16.22C44.0823 16.22 47.6943 19.664 47.6943 25.166V41H42.3603V31.004H39.3363C35.5983 31.004 33.3303 32.348 33.3303 34.406C33.3303 35.876 34.4643 36.926 36.3963 36.926C37.0683 36.926 37.8663 36.8 38.5803 36.506V41.042C37.4883 41.42 36.3543 41.588 35.1783 41.588ZM46.8645 13.784H28.4265V9.962H46.8645V13.784ZM62.4045 18.866L66.3525 16.388C71.0985 17.354 73.4505 20.714 73.4505 25.418V41H68.2005V25.922C68.2005 23.612 67.4025 22.184 65.6385 21.554L62.5305 23.528H62.2785L59.1705 21.554C57.1125 22.604 55.5165 24.704 55.5165 28.904C55.5165 31.718 56.2305 34.784 58.0785 38.144C59.6745 36.086 60.6405 33.734 60.8085 31.214H58.2885V26.888H64.9245C65.0925 27.728 65.1765 28.694 65.1765 29.618C65.1765 33.146 64.1685 37.094 60.8925 41H54.4245C51.4845 36.758 50.3505 32.6 50.3505 28.904C50.3505 22.142 53.5005 17.816 58.4565 16.388L62.4045 18.866ZM88.6239 16.22C95.0499 16.22 99.2499 20.084 99.2499 26.09V41H93.9159V26.51C93.9159 23.234 91.7319 21.092 88.2879 21.092C85.8519 21.092 83.8359 22.184 82.7019 24.242L86.9019 25.418V28.316C85.3059 29.198 84.5919 30.5 84.5919 32.768V36.086C84.5919 39.362 82.8279 41 79.3839 41H76.6119V36.128H77.9139C78.8799 36.128 79.3419 35.666 79.3419 34.7V32.81C79.3419 30.248 80.1399 28.652 82.0719 27.602V27.392L77.5359 26.258V23.066C79.6359 18.572 83.6259 16.22 88.6239 16.22ZM101.469 13.784H91.683C87.861 13.784 86.097 12.104 86.097 8.45V7.19H90.885V8.408C90.885 9.416 91.389 9.962 92.439 9.962H101.469V13.784ZM131.331 31.214V16.808H136.707V41H131.373V37.766H131.121C129.861 40.076 127.677 41.546 124.653 41.546C120.243 41.546 117.429 38.396 117.429 32.81V26.342C117.429 23.192 115.371 21.092 112.221 21.092C109.953 21.092 108.021 22.184 106.929 24.284L111.045 25.418V28.316C108.903 29.114 108.147 30.29 108.147 32.306V34.532C108.147 35.624 108.693 36.128 109.743 36.128H111.423V41H108.105C104.619 41 102.855 39.362 102.855 36.086V32.81C102.855 30.248 103.779 28.652 106.173 27.602V27.392L101.805 26.258V23.066C103.821 18.572 107.685 16.22 112.557 16.22C118.689 16.22 122.805 20 122.805 25.922V31.802C122.805 34.826 124.233 36.59 126.711 36.59C129.357 36.59 131.331 34.49 131.331 31.214ZM146.723 41H141.389V32.264C141.389 29.366 142.229 27.35 145.043 24.032C144.623 22.394 143.195 21.638 140.675 21.638H140.381V16.43H140.675C143.237 16.43 144.791 17.858 145.589 20.126L146.765 16.808H149.495V20.378C151.637 17.648 153.989 16.304 156.677 16.304C160.121 16.304 161.759 18.404 161.759 22.478V41H156.425V23.612C156.425 21.974 155.921 21.386 154.829 21.386C153.485 21.386 152.183 22.352 148.907 26.342C147.185 28.4 146.723 29.87 146.723 32.012V41ZM158.871 13.784H154.083V12.818C154.083 9.248 155.847 7.61 159.585 7.61H162.903V11.432H160.425C159.375 11.432 158.871 11.978 158.871 12.986V13.784Z" fill="black"/>
                        </svg>
                    </div>
                    <div class='fascinate-notes-hello'>
                        <img src='../assets/fascinate-notes/fascinate-note-section-hello.png' alt=''>
                    </div>
                </div>
                <div class='fascinate-notes-buttons'>
                    
                        <a href='https://github.com/Peakk2011/Fascinate-Note' target='_blank' data-ripple>
                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M0 8.19643H11.0879L5.98796 13.2964L7.28571 14.5714L14.5714 7.28571L7.28571 0L5.98796 1.27499L11.0879 6.375H0V8.19643Z" fill="white"/>
                            </svg>
                            <span data-scramble-hover-fx data-scramble-duration="800" data-scramble-chars="01010101">สำรวจ</span>
                        </a>
                    
                        <a href='https://github.com/Peakk2011/Fascinate-Note/releases/tag/v1.1.0' target='_blank' id='fascinate-notes-buttons-active' data-ripple>
                            <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M0 8.19643H11.0879L5.98796 13.2964L7.28571 14.5714L14.5714 7.28571L7.28571 0L5.98796 1.27499L11.0879 6.375H0V8.19643Z" fill="black"/>
                            </svg>
                            <span data-scramble-hover-fx data-scramble-duration="800" data-scramble-chars="01010101">Download</span>
                        </a>
                    
                </div>
                <div class='fascinate-notes-p'>
                    <p>
                    Fascinate Note คือแอพโน้ตที่ทำให้การทำงานสำหรับการเขียนบันทึก<br>
                    ในความรู้สึก หรือเรื่องต่างๆ ในตัวอย่างเช่นการเขียนรายงาน<br>
                    หรือการเขียนเอกสาร ที่จะทำให้คุณ รู้สึกว่ามันหลงไหลหรือถูกเข้าไปใน Flow<br>
                    ที่ยากต่อการออกและปราศจาก สิ่งรบกวนไดๆของแอพ<br>
                    ที่จะทำให้การทำงานนั้นช้าลง
                    </p>
                </div>

                <div class='center-fascinate-notes-content-card'>
                    <div class='fascinate-notes-card-1'>
                        <div class='flex-fascinate-notes-card-1'>
                            <div class='flex-content-fascinate-notes-content-1'>
                                <img src='../assets/fascinate-notes/preview/image-of-fascinate-notes-1.png'>
                            </div>
                            <div class='flex-content-fascinate-notes-content-2'>
                                <p>
                                    นี่คือหนึ่งในโปรเจกต์ที่ทะเยอทะยานที่สุด<br>
                                    ที่ตั้งใจจะสร้างขึ้นในช่วงเวลานี้<br>
                                    โปรเจกต์นี้คือการพัฒนา Note Application ใหม่<br>
                                    ที่ถูกออกแบบให้เป็นพื้นที่ทำงานแบบเต็มหน้าจอ<br>
                                    ที่ผู้ใช้สามารถเขียน สร้าง จัดระเบียบ ความคิด ได้อิสระที่สุด<br>
                                    <br>
                                    เป้าหมายของโปรเจกต์นี้คือการสร้าง<br>
                                    Note Application ที่แตกต่างจากแอปทั้วไป<br>
                                    ได้อย่างชัดเจน โดยเน้นประสบการณ์เขียน<br>
                                    ที่มีความลื่นไหลและเรียบง่าย โดยไม่รบกวน<br>
                                    องค์ประกอบที่มันไม่จำเป็นในตัวแอพ
                                </p>
                            </div>
                        </div>
                        <div class='flex-fascinate-notes-card-2'>
                            <div class='flex-content-fascinate-notes-content-card2-2'>
                                <p>
                                    แอพนี้ ผู้ใช้สามารถเขียน จัดรูปแบบ<br>
                                    และจัดโครงสร้างข้อความได้อย่างที่ต้องการ<br>
                                    โดยระบบการจัดข้อความจะถูกออกแบบมาให้<br>
                                    เรียบง่ายแล้วเป็นธรรมชาติ ไม่ขัดหูขัดตาพร้อมทั้ง<br>
                                    ให้การรูปแบบข้อความเป็นส่วนหนึ่งของการเขียน<br>
                                    ไม่ใช่ขั้นตอนที่ต้องหยุดเพื่อจัดการเครื่องมือ<br>
                                    <br>
                                    อีกหนึ่งแนวคิดสำคัญ คือ Workspace แบบเต็มหน้าจอ<br>
                                    พื้นที่ที่ถูกออกแบบมาเพื่อการเขียนโดยเฉพาะ<br>
                                    ตัวอย่างคือในรูปด้านล่าง ที่ไม่มีองค์ประกอบที่ไม่จำเป็น<br>
                                    ไม่มีสิ่งรบกวนสายตา แล้วมีให้แค่พื้นที่ว่างที่รอให้<br>
                                    ความคิดถูกถ่ายทอดออกมา<br>
                                </p>
                            </div>

                            <div class='flex-content-fascinate-notes-content-card2-2-image'>
                                <img src='../assets/fascinate-notes/preview/image-of-fascinate-notes-2.png'>
                            </div>
                        </div>
                    </div>

                    <div class='fascinate-notes-card-2'>
                        <div class='flex-content-fascinate-notes-content-1-card-2'>
                            <div class='flex-content-fascinate-notes-content-1-card-2-text-description'>
                                <p>
                                    ถ้าแนวคิดของแอพนี้เริ่มต้นจากคำถามง่าย ๆ ว่า”พื้นที่สำหรับการเขียนที่ดีที่สุดควรเป็นอย่างไร”<br>
                                    <br>
                                    เครื่องมือสำหรับการจดโน้ตหรือการเขียนเอกสารที่มี<br>
                                    อยู่ในปัจจุบันมักจะพยายามเพิ่มความสามารถจำนวนมาก<br>
                                    เข้าไปในระบบ แต่ในขณะเดียวกันก็ทำให้ประสบการณ์การเขียน<br>
                                    ซับซ้อนขึ้น ผู้ใช้ต้องเสียเวลาไปกับเมนู เครื่องมือ<br>
                                    และองค์ประกอบต่าง ๆ ที่เข้ามาขัดจังหวะความคิด<br>
                                    <br>
                                    แอพนี้เลยเริ่มตรงกันข้าม<br>
                                    แทนที่จะสร้างแอปที่เต็มไปด้วยเครื่องมือที่เยอะแยะ<br>
                                    เราต้องการจะสร้าง พื้นที่เดียวที่เรียบง่าย แต่ใช้ได้ทุกบริบท<br>
                                    พื้นที่ที่ผู้ใช้สามารถเปิดขึ้นมาแล้วเริ่มเขียนได้ทันที<br>
                                    โดยไม่ต้องคิดถึงระบบที่อยู่เบื้องหลัง<br>
                                </p>
                            </div>
                            <div class='flex-content-fascinate-notes-content-1-card-2-image'>
                                <img src='../assets/fascinate-notes/preview/image-of-fascinate-notes-3.png'>
                            </div>
                        </div>
                    </div>
                </div>

            </div>
        </section>
    `
};